package Lesson_Cycles;

/**
 * Задачи на циклы:
 *
 * 1. Вывод квадратов натуральных чисел - Exr1
 *
 * 2. Кубы чисел от A до B - Exr2
 *
 * 3. Возведение числа в степень - Exr3
 *
 * 4. Составьте таблицу значений функции - Exr4
 *
 * 5. Вычисление факториала числа - Exr5
 *
 * 6. Числа Фибоначчи - Exr6
 *
 * 7. Проверка гипотезы Сиракуз - пропустил
 *
 * 8. Извлечение цифр числа - Exr8
 *
 * 9. Найти сумму четных цифр числа - пропустил
 *
 * 10. Посчитать четные и нечетные цифры числа - Exr10
 *
 * 11. Сумма и произведение цифр числа
 *
 * 12. Определить, какая цифра числа больше - Exr12
 *
 * 13. Сумма первой и последней цифр числа - Exr13
 *
 * 14. "Переворот" числа - Exr14
 *
 * 15. Найти одинаковые цифры двух чисел -Exr15
 *
 * 16. Удалить цифру из числа - Exr16
 *
 * 17. Определить количество простых чисел - Exr17
 *
 * 18. Вывести делители чисел - Exr18
 *
 * 19. Совершенные числа - Exr19
 *
 * 20. Вычисление сумм различных рядов чисел - пропустил
 *
 * 21. Вывод на экран таблицы ASCII - пропустил
 *
 * 22. Таблица умножения на Паскале - пропустил
 *
 * 23. Комбинации из трех чисел, дающие в сумме заданное число - Exr23
 *
 * 24. Решение системы уравнений - Exr24
 *
 * 25. Простейший калькулятор - Exr25
 *
 * 26. Программа "Угадай число" -Exr26
 */

public class Instructhion {
}
