package Lesson_Arrays;

/**
 * Решение задач на массивы:
 *
 * 1. Сумма и произведение элементов одномерного массива - Exr1
 *
 * 2. Сумма положительных элементов массива - Exr2
 *
 * 3. Сумма элементов частей массива - Exr3
 *
 * 4. Первый положительный элемент массива - Exr4
 *
 * 5. Поиск максимального элемента в массиве - Exr5
 *
 * 6. Максимальный по модулю элемент массива
 *
 * 7. Найти два максимальных элемента массива
 *
 * 8. Заменить элементы массива на противоположные - Exr8
 *
 * 9. Разделить элементы массива на максимальный - Exr9
 *
 * 10. Найти разность между максимальным и минимальным элементами массива - Exr10
 *
 * 11. Поменять местами минимальный и максимальный элементы массива - Exr11
 *
 * 12. Найти количество положительных элементов массива - Exr12
 *
 * 13. Количества отрицательных и положительных элементов в массиве - Exr13
 *
 * 14. Вывести элементы массива, которые больше среднего арифметического - Exr14
 *
 * 15. Элементы массива, которые больше предыдущего - Exr15
 *
 * 16. Определить индексы элементов массива, значение которых лежит в указанном пределе -Exr16
 *
 * 17. Самая длинная последовательность, состоящая из одинаковых элементов -Exr17
 *
 * 18. Есть ли в массиве одинаковые элементы -Exr18
 *
 * 19. Вставка элемента в массив -Exr19
 *
 * 20. Удаление элементов одномерного массива
 *
 * 21. Удалить повторяющиеся элементы из массива
 *
 * 22. Слияние двух упорядоченных массивов
 *
 * 23. Сортировка выбором
 *
 * 24. Сортировка методом пузырька
 *
 * 25. Вывести в порядке возрастания цифры, из которых состоит число
 *
 * 26. Номер дня с начала года
 */

public class Instructhion {
}
